app/controllers/api/products_controller.rb

  def index
    @products = Product.active.order(created_at: :desc)
---
SELECT "products".* FROM "products" WHERE "products"."active" = ? ORDER BY "products"."created_at" DESC  [["active", 1]]

  def create
    @product = Product.new(product_params)
    @product.status = 'active'
    if @product.price > 10000
      render json: { error: "Price cannot exceed $10,000" }, status: :unprocessable_entity and return
    elsif @product.price > 5000
    	@product.status = 'pending'
      @product.build_approval_queue
    end

    if @product.save
---
INSERT INTO "approval_queues" ("product_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["product_id", 9], ["created_at", "2024-02-22 13:17:06.397169"], ["updated_at", "2024-02-22 13:17:06.397169"]]
INSERT INTO "products" ("name", "price", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Fridge"], ["price", 8000.0], ["status", "pending"], ["created_at", "2024-02-22 13:17:06.395672"], ["updated_at", "2024-02-22 13:17:06.395672"]]

  def update
    # Save previous price for comparison
    previous_price = @product.price

    if @product.update(product_params)
      # Check if the new price is more than 50% of the previous price
      if @product.price > (previous_price * 1.5)
        # If so, push the product to the approval queue
        @product.approval_queue ||= ApprovalQueue.new
        @product.approval_queue.save!
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 80000.0], ["updated_at", "2024-02-23 06:56:31.737113"], ["id", 21]]
INSERT INTO "approval_queues" ("product_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["product_id", 21], ["created_at", "2024-02-23 06:56:31.743531"], ["updated_at", "2024-02-23 06:56:31.743531"]]

  def search
    @products = Product.all

    if params[:productName].present?
      @products = @products.where("name LIKE ?", "%#{params[:productName]}%")
    end
    if params[:minPrice].present?
      @products = @products.where("price >= ?", params[:minPrice])
---
SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE (name LIKE '%AU091%') AND (price >= '100')

  def approval_queue
  	@queues = ApprovalQueue.order(created_at: :desc)
---
SELECT "approval_queues".* FROM "approval_queues" ORDER BY "approval_queues"."created_at" DESC

  def approve
    @product = @approval_queue.product
    # Update product state and remove from approval queue
    if @product.update(status: 'active') && @approval_queue.destroy
---
DELETE FROM "approval_queues" WHERE "approval_queues"."id" = ?  [["id", 14]]
UPDATE "products" SET "status" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["status", "active"], ["updated_at", "2024-02-23 06:55:12.948872"], ["id", 21]]

  def reject
    # Remove product from approval queue
    if @approval_queue.destroy
---
DELETE FROM "approval_queues" WHERE "approval_queues"."id" = ?  [["id", 1]]

  def set_approval_queue
    begin
      @approval_queue = ApprovalQueue.find(params[:approvalId])
---
SELECT "approval_queues".* FROM "approval_queues" WHERE "approval_queues"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]